Revit 2017 API
RevitLinkLoadResult Class
 This class stores the results of trying to load a single linked model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public class RevitLinkLoadResult : IDisposable
Visual Basic
Public Class RevitLinkLoadResult _
	Implements IDisposable
Visual C++
public ref class RevitLinkLoadResult : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RevitLinkLoadResult
See Also
RevitLinkLoadResult Members
Autodesk.Revit.DB Namespace